0/ReThetat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ReThetat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            zeroGradient;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
        value           $internalField;
    }

        frontAndBack
  {
    type empty;
      }
    "wall.*"
    {
        type            nutLowReWallFunction;
        value           $internalField;
    }
    "wedge.*"
    {
        type wedge;
    }
    "proc.*"
    {
      type processor;
    }
}


// ************************************************************************* //
