0/TMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      TMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
322.8269959
322.1334183
321.3468924
320.499864
319.9029196
319.6442178
319.4345274
319.2281312
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
322.8236241
322.1219158
321.3149512
320.3869421
319.8426091
319.7485667
319.640418
319.5160469
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
322.946015
322.5074474
322.0030945
321.4230888
321.06334
320.9622122
320.8459152
320.7121737
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           uniform 323.15;
    }
    wall_right
    {
        type            calculated;
        value           uniform 283.15;
    }
}


// ************************************************************************* //
