0/TPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      TPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 2 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
3.115860454e-05
0.0002805839758
0.0008206618222
0.001781123705
0.003276270741
0.005431044992
0.008364280031
0.01211855494
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-6.4028427e-10
7.275957614e-11
8.731149137e-11
-1.862645149e-09
2.401066013e-09
6.548361853e-10
2.22644303e-09
-1.964508556e-09
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.426087692e-09
-6.693881005e-10
4.569301382e-09
-5.820766091e-10
-9.895302355e-10
-9.313225746e-10
-1.004082151e-09
1.527951099e-09
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           uniform 1.731677912e-09;
    }
    wall_right
    {
        type            calculated;
        value           uniform -3.055902198e-10;
    }
}


// ************************************************************************* //
