0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31329
(
(0.0006728112287 0 0.0006866646037)
(0.0008184310964 0 0.0005142911478)
(9.279183026e-05 0 0.0001450922903)
(-0.0003369768907 0 5.394594941e-05)
(-0.000529256034 0 2.869638238e-05)
(-0.0006693863505 0 1.334717163e-05)
(-0.0007729468126 0 5.749961507e-06)
(-0.00083275129 0 1.21649136e-06)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            noSlip;
    }
    wall_top
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            noSlip;
    }
    wall_right
    {
        type            noSlip;
    }
}


// ************************************************************************* //
