0/UMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      UMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
31329
(
(0.0003120064757 0 0.0003186831834)
(0.0003307699137 0 0.0002485751321)
(-0.0001413707721 0 9.324622028e-05)
(-0.0005486391375 0 5.565098716e-05)
(-0.000893850554 0 4.212964501e-05)
(-0.00122568147 0 3.042284149e-05)
(-0.001514951907 0 1.987865201e-05)
(-0.001715748818 0 9.396753149e-06)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    wall_right
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
