0/UPrime2Mean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volSymmTensorField;
    location    "0";
    object      UPrime2Mean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
31329
(
(3.053179013e-07 0 3.061277395e-07 0 0 3.069565639e-07)
(5.35016876e-07 0 2.898739657e-07 0 0 1.57324896e-07)
(6.450583151e-08 0 2.319298921e-08 0 0 8.871258078e-09)
(1.188749415e-08 0 4.463988544e-10 0 0 5.570388077e-10)
(3.037549649e-08 0 -9.293362034e-10 0 0 9.283177914e-11)
(6.942297348e-08 0 -2.119119418e-09 0 0 6.828269749e-11)
(1.302079685e-07 0 -2.961927997e-09 0 0 7.841590057e-11)
(2.126513034e-07 0 -3.560094641e-09 0 0 8.924365742e-11)
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    wall_top
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
    wall_right
    {
        type            calculated;
        value           uniform (0 0 0 0 0 0);
    }
}


// ************************************************************************* //
