0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
2.483132724e-08
2.567068809e-08
1.714821927e-09
3.376189395e-09
7.959013416e-09
1.266413802e-08
1.67965501e-08
1.935656614e-08
...
)
;

boundaryField
{
    wall_bottom
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
    wall_top
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1.584228525e-15
5.381108514e-15
...
)
;
    }
    wall_right
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
}


// ************************************************************************* //
