0/kMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      kMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
2.18304944e-08
2.376034337e-08
3.794821756e-09
9.27839818e-09
2.388180316e-08
4.502904679e-08
6.938265179e-08
9.029165679e-08
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.647131616e-15
1.829126533e-15
1e-15
1e-15
1.071460328e-15
2.279691104e-15
5.358228949e-15
9.639464746e-15
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.643990739e-15
2.114000665e-15
1.000766046e-15
1e-15
1.65466129e-15
8.229395357e-15
3.459043477e-14
1.116123791e-13
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
1e-15
...
)
;
    }
}


// ************************************************************************* //
