0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
3.899420696e-13
4.050349798e-13
2.717670165e-14
5.378018096e-14
1.271624402e-13
2.024420919e-13
2.68661083e-13
3.098214783e-13
...
)
;

boundaryField
{
    wall_bottom
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    wall_top
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    wall_right
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
