0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
63679.52878
63378.94102
63098.97166
62777.57596
62589.34163
62556.84232
62519.47588
62476.51468
...
)
;

boundaryField
{
    wall_bottom
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
177
(
63679.52878
63378.94102
63098.97166
62777.57596
62589.34163
62556.84232
62519.47588
62476.51468
...
)
;
    }
    wall_top
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
177
(
63834.47292
63774.18115
63598.28866
63396.23516
63271.03126
63235.85216
63195.40515
63148.90299
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
177
(
63679.52878
63736.29416
63736.29641
63736.29918
63736.30247
63736.30635
63736.31089
63736.31622
...
)
;
    }
    wall_right
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
177
(
50509.12249
50598.89747
50598.89974
50598.90234
50598.90533
50598.90877
50598.91274
50598.91729
...
)
;
    }
}


// ************************************************************************* //
