0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
101284.9943
101284.9941
101284.9943
101284.9944
101284.9946
101284.9947
101284.9948
101284.9949
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101284.9959
101284.9957
101284.9959
101284.9961
101284.9962
101284.9963
101284.9964
101284.9965
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101276.4492
101276.4492
101276.4492
101276.4491
101276.4491
101276.4491
101276.4491
101276.4491
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101284.9943
101284.9907
101284.9868
101284.9824
101284.9772
101284.9712
101284.9642
101284.9561
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101285.017
101285.0131
101285.0086
101285.0034
101284.9974
101284.9905
101284.9826
101284.9734
...
)
;
    }
}


// ************************************************************************* //
