0/pMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
101328.499
101328.4989
101328.4989
101328.499
101328.4991
101328.4992
101328.4993
101328.4994
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101328.5006
101328.5005
101328.5006
101328.5006
101328.5007
101328.5008
101328.5009
101328.501
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101319.9593
101319.9593
101319.9593
101319.9593
101319.9593
101319.9593
101319.9593
101319.9593
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101328.499
101328.4954
101328.4915
101328.487
101328.4817
101328.4756
101328.4685
101328.4603
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
101328.5246
101328.5207
101328.5162
101328.5109
101328.505
101328.4981
101328.4902
101328.4811
...
)
;
    }
}


// ************************************************************************* //
