0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
101284.9959
101284.9957
101284.9959
101284.9961
101284.9962
101284.9963
101284.9964
101284.9965
...
)
;

boundaryField
{
    wall_bottom
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
177
(
101284.9959
101284.9957
101284.9959
101284.9961
101284.9962
101284.9963
101284.9964
101284.9965
...
)
;
    }
    wall_top
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
177
(
101284.4858
101284.4967
101284.5093
101284.5238
101284.5329
101284.5354
101284.5383
101284.5417
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
177
(
101284.9959
101284.9957
101284.9959
101284.996
101284.9961
101284.9961
101284.9961
101284.996
...
)
;
    }
    wall_right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
177
(
101285.0189
101285.0189
101285.0189
101285.0189
101285.0189
101285.0189
101285.0189
101285.0189
...
)
;
    }
}


// ************************************************************************* //
