0/rhoMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rhoMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
31329
(
1.093265762
1.095619646
1.098301281
1.101203921
1.103258803
1.104151741
1.104876585
1.105590981
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.0932772
1.095658787
1.098410473
1.101592049
1.103466824
1.10379137
1.104164833
1.104594629
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.092770746
1.09425677
1.095970703
1.097948374
1.099178616
1.099524942
1.099923486
1.10038217
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.092172991
1.092172953
1.092172911
1.092172862
1.092172805
1.09217274
1.092172663
1.092172574
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
1.246462269
1.24646222
1.246462165
1.246462101
1.246462027
1.246461942
1.246461845
1.246461733
...
)
;
    }
}


// ************************************************************************* //
