0/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-2.434807567
-7.6874206
-15.64887033
-35.59509339
-30.86997813
-5.629062711
7.167935036
15.92568913
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-2.416896528
-7.833057423
-15.41191605
-30.36409923
-30.88085821
-19.36407492
-15.1802339
-13.35099714
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
59.5290387
55.26176606
51.7728203
49.49653601
48.69452985
49.36751885
51.41026672
54.63884631
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-12.06505002
-10.82436602
-9.633980626
-8.617255975
-7.851801075
-7.380377351
-7.228909072
-7.421182183
...
)
;
    }
}


// ************************************************************************* //
