0/wallHeatFluxMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      wallHeatFluxMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-0.6396851186
-2.178556179
-6.038001827
-21.29896999
-11.36076823
19.65191418
38.76511401
54.19264599
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-2.349037159
-7.617673922
-15.02213172
-29.76844569
-30.05141134
-18.28194066
-13.83611014
-11.75433349
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
61.32554799
60.6698274
61.18149433
63.34060861
67.346419
73.07973279
80.18480993
88.16430568
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
-12.07607916
-10.85839606
-9.691686481
-8.693488758
-7.928635677
-7.417281128
-7.154537502
-7.1230992
...
)
;
    }
}


// ************************************************************************* //
