0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-0.0001272332561 0 -8.716870822e-05)
(-9.157570179e-05 0 -9.903123998e-05)
(-2.731472302e-07 0 -4.43784961e-05)
(4.625012071e-05 0 -1.839185307e-05)
(6.926667857e-05 0 -9.097089557e-06)
(8.699841957e-05 0 -4.943267566e-06)
(0.0001001683739 0 -2.543117281e-06)
(0.0001077833914 0 -9.024287435e-07)
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-2.553244236e-07 0 -1.628734386e-06)
(-3.982446741e-06 0 -2.60778907e-06)
(-9.545980466e-06 0 -2.921172552e-06)
(-1.639722198e-05 0 -2.716195814e-06)
(-2.391907336e-05 0 -2.494321706e-06)
(-3.238821616e-05 0 -2.497152736e-06)
(-4.215019721e-05 0 -2.497499072e-06)
(-5.327679969e-05 0 -2.480045323e-06)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-8.165296497e-05 0 -0.0001275878326)
(-8.63909504e-05 0 -0.0001091671947)
(-2.683152557e-05 0 -4.937102164e-05)
(2.35340776e-07 0 -4.528423628e-05)
(9.070895204e-06 0 -7.334535924e-05)
(1.227623744e-05 0 -0.0001124898363)
(1.343465026e-05 0 -0.0001606440711)
(1.420391704e-05 0 -0.0002187080656)
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(6.678930737e-07 0 1.416099473e-07)
(7.96466605e-07 0 1.446399164e-06)
(7.610590656e-07 0 3.007468116e-06)
(7.267824788e-07 0 4.931042351e-06)
(7.163741785e-07 0 7.262343353e-06)
(6.761290004e-07 0 1.002274444e-05)
(5.401863598e-07 0 1.300088111e-05)
(2.783770961e-07 0 1.567070048e-05)
...
)
;
    }
}


// ************************************************************************* //
