0/wallShearStressMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStressMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-5.931695806e-05 0 -4.145265037e-05)
(-3.6836045e-05 0 -5.103696955e-05)
(2.330104814e-05 0 -3.061793306e-05)
(7.222889247e-05 0 -2.036510815e-05)
(0.0001161621542 0 -1.563265391e-05)
(0.0001589661368 0 -1.194080173e-05)
(0.0001962826782 0 -8.054707685e-06)
(0.000222155527 0 -3.902677251e-06)
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-3.478206311e-07 0 -2.00049392e-06)
(-4.618602799e-06 0 -2.913491214e-06)
(-1.019622255e-05 0 -2.847096936e-06)
(-1.597848925e-05 0 -2.110145948e-06)
(-2.077099544e-05 0 -1.312366371e-06)
(-2.433906215e-05 0 -7.579375734e-07)
(-2.656764687e-05 0 -2.570781485e-07)
(-2.713630466e-05 0 1.80318855e-07)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(-3.66375464e-05 0 -5.862491116e-05)
(-3.297643488e-05 0 -5.757964631e-05)
(-3.575222591e-07 0 -4.926991544e-05)
(1.626130015e-05 0 -8.082564531e-05)
(2.314671711e-05 0 -0.0001415805416)
(2.600990058e-05 0 -0.0002212170988)
(2.640712704e-05 0 -0.0003167291994)
(2.508731593e-05 0 -0.0004245067075)
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<vector> 
177
(
(9.602792018e-07 0 1.340619236e-07)
(1.612981297e-06 0 2.386580152e-06)
(1.890105138e-06 0 5.863870795e-06)
(1.853911596e-06 0 1.026848713e-05)
(1.633899507e-06 0 1.504178648e-05)
(1.310846939e-06 0 1.973943591e-05)
(9.284389158e-07 0 2.391093304e-05)
(5.217584247e-07 0 2.708254577e-05)
...
)
;
    }
}


// ************************************************************************* //
