0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
0.08977359432
0.09019186144
0.03815528349
0.05384689149
0.06720735476
0.07555436151
0.08120607393
0.08431694386
...
)
;
    }
    wall_top
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
0.007745358753
0.01640875271
0.024847104
0.03255739347
0.03940691352
0.04588818768
0.05236790782
0.05890420866
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_left
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
0.089693607
0.09473169469
0.06348331755
0.05537929895
0.06891207294
0.08507691401
0.1015602462
0.1184755355
...
)
;
    }
    wall_right
    {
        type            calculated;
        value           nonuniform List<scalar> 
177
(
0.006097441966
0.01147014098
0.01637994618
0.02099663399
0.02549351278
0.02994582121
0.03409960561
0.03743472914
...
)
;
    }
}


// ************************************************************************* //
