constant/fvOptions.bSource
/*--------------------------------*- C++ -*----------------------------------*\
|j =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buoyancyTurbSource1
{
    type                 buoyancyTurbSource;
    selectionMode        all;
    rho             rho;
    alphat          alphat;
    T               T;
}
