system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
    "f.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }

    "(p_rgh|cellDisplacement)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|h|e|k|phit|epsilon|R|omega|gammaInt|ReThetat)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|h|e|k|phit|epsilon|R|omega|gammaInt|ReThetat)Final"
    {
        $U;
        relTol          0;
    }
    // "pcorr.*"
    // {
    //     $p_rgh;
    //     tolerance       1e-12;
    //     relTol          0;
    // }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           1e5;
    ddtCorr             true;

    // residualControl
    // {
    //     // h
    //     // {
    //     //     tolerance       1e-4;
    //     //     relTol          0;
    //     // }
    //     p_rgh
    //     {
    //         tolerance       1e-8;
    //         relTol          0;
    //     }
    // }

}

// relaxationFactors
// {
//   fields
//   {
//     p_rgh 0.7;
//     rho   0.7;
//     "(p_rgh|rho)Final" 1;
//     // ".*Final" 1;
//   }
//   equations
//   {
//     U   0.3;
//     h   0.2;
//     "(h|e|U|T|k|epsilon)Final" 1;
//   }
// }
