system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
  version   2.0;
  format    ascii;
  class     dictionary;
  location  "system";
  object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/gas_edges.fms";

maxCellSize 0.02;

boundaryCellSize 0.03;

// minCellSize 0.015;

localRefinement
{
  ".*"
  {
    additionalRefinementLevels 1;
  }
}
//
  objectRefinements
{
  outlet
  {
    cellSize 0.005;
    type sphere;
    centre (0 0.62 0);
    radius 0.04;
  }
}

renameBoundary
{
  defaultName walls;
  defaultType wall;
  newPatchNames
  {
    patch0_1
    {
      newName bottom;
      type wall;
    }
  }
}

boundaryLayers
{
  patchBoundaryLayers
  {
    ".*"
    {
      nLayers 10;
      thicknessRatio 1.2;
      maxFirstLayerThickness 0.01;
      allowDiscontinuity 0;
    }
  }
}

// ************************************************************************* //
