system/meshdata
R 0.6203504908994001;
r 0.0105;
wall_cell_size 0.00115;
y_interface 0.28466296352359255;
l_bl 0.08284037405387158;
wedge_angle 1;
NX 27;
N01 24;
N65 27;
G01 (( 0.3874  0.6250  12.8392)( 0.6126  0.3750 1));
G65 (( 0.6881  0.4444 1)( 0.3119  0.5556  0.0779));
vertices
((0.000000000000000 -0.620350490899400 -0.001000000000000)//0
(0.000000000000000 -0.449761696106905 -0.001000000000000)//1
(0.000000000000000 0.284662963523593 -0.001000000000000)//2
(0.000000000000000 0.465095390099736 -0.001000000000000)//3
(0.000000000000000 0.620350490899400 -0.001000000000000)//4
(0.381593018922638 0.489102749397950 -0.001000000000000)//5
(0.551182119409812 0.284662963523593 -0.001000000000000)//6
(0.325461972443013 -0.528118581430942 -0.001000000000000)//7
(0.232031106762490 -0.369256783544031 -0.001000000000000)//8
(0.337352031312174 0.284662963523593 -0.001000000000000)//9
(0.301848491417262 0.393931625148427 -0.001000000000000)//10
(0.000000000000000 -0.620350490899400 0.001000000000000)//11
(0.000000000000000 -0.449761696106905 0.001000000000000)//12
(0.000000000000000 0.284662963523593 0.001000000000000)//13
(0.000000000000000 0.465095390099736 0.001000000000000)//14
(0.000000000000000 0.620350490899400 0.001000000000000)//15
(0.381593018922638 0.489102749397950 0.001000000000000)//16
(0.551182119409812 0.284662963523593 0.001000000000000)//17
(0.325461972443013 -0.528118581430942 0.001000000000000)//18
(0.232031106762490 -0.369256783544031 0.001000000000000)//19
(0.337352031312174 0.284662963523593 0.001000000000000)//20
(0.301848491417262 0.393931625148427 0.001000000000000)//21
);