system/setExprBoundaryFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprBoundaryFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pattern
{
  field T;
expressions
(
    {
        patch       wall_top;
        target      value;
        variables
        (
          "x=pos().x()"
        );
        expression
        #{
          x<0.0015 ? -1360.0000000000136*x + 323.15 :
          x<0.0050025 ? -179.30049964310803*x + 321.3789507494646 :
          x<0.009975 ? 7.239819004525162*x + 320.4457828054298 :
          x<0.020025 ? -63.28358208955463*x + 321.14925373134326 :
          x<0.039975 ? -80.40100250626493*x + 321.4920300751879 :
          x<0.07500000000000001 ? -65.32476802284111*x + 320.889357601713 :
          x<0.15000000000000002 ? -32.69333333333331*x + 318.44199999999995 :
          x<0.22499999999999998 ? -26.133333333333077*x + 317.4579999999999 :
          x<0.30000000000000004 ? -17.493333333333474*x + 315.514 :
          x<0.375 ? -20.58666666666645*x + 316.4419999999999 :
          x<0.44999999999999996 ? -13.759999999999772*x + 313.8819999999999 :
          x<0.5249999999999999 ? -29.7066666666668*x + 321.05800000000005 :
          x<0.6000000000000001 ? -37.22666666666698*x + 325.00600000000014 :
          x<0.675 ? -80.42666666666648*x + 350.9259999999999 :
          x<0.710025 ? -118.08708065667459*x + 376.34677944325534 :
          x<0.729975 ? -186.26566416039836*x + 424.75527819548677 :
          x<0.740025 ? -29.850746268657836*x + 310.5762985074635 :
          x<0.7449749999999999 ? -80.80808080808934*x + 348.2860000000063 :
          x<0.7484999999999999 ? -302.9787234042507*x + 513.7975744680816 :
          -2578.6666666665656*x + 2217.15
        #};
    }
   {
         patch       wall_bottom;
         target      value;
         variables
         (
          "x=pos().x()"
         );
         expression
         #{
            x<0.0015 ? -2176.000000000007*x + 323.15 :
            x<0.0050025 ? -166.73804425410512*x + 320.1361070663811 :
            x<0.009975 ? -141.57868275515492*x + 320.01024736048265 :
            x<0.020025 ? -88.75621890547221*x + 319.48334328358203 :
            x<0.039975 ? -181.65413533834425*x + 321.3436240601503 :
            x<0.07500000000000001 ? -128.47965738758026*x + 319.2179743040685 :
            x<0.15000000000000002 ? -71.73333333333326*x + 314.962 :
            x<0.22499999999999998 ? -39.626666666667184*x + 310.1460000000001 :
            x<0.30000000000000004 ? -29.866666666666763*x + 307.95 :
            x<0.375 ? -24.373333333333008*x + 306.30199999999985 :
            x<0.44999999999999996 ? -20.640000000000036*x + 304.902 :
            x<0.5249999999999999 ? -21.013333333333637*x + 305.0700000000001 :
            x<0.6000000000000001 ? -27.09333333333303*x + 308.2619999999998 :
            x<0.675 ? -38.61333333333356*x + 315.1740000000001 :
            x<0.710025 ? -63.04068522483859*x + 331.66246252676603 :
            x<0.729975 ? -98.84711779448794*x + 357.0859248120313 :
            x<0.740025 ? -37.01492537313006*x + 311.9499701492506 :
            x<0.7449749999999999 ? -64.6464646464646*x + 332.39799999999997 :
            x<0.7484999999999999 ? -98.72340425532288*x + 357.78446808510915 :
            -493.3333333333207*x + 653.1499999999905
         #};
     }
);

 }

 

// ************************************************************************* //
